Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__xiaoya-luming-002__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 四牡騑騑，周道倭遲。豈不懷歸？王事靡盬，我心傷悲。
en: My four steeds advanced without stopping; The way from Zhou was winding and tedious. Did I not have the wish to return? But the king's business was not to be slackly performed; And my heart was wounded with sadness.

source: 四牡騑騑，嘽嘽駱馬。豈不懷歸？王事靡盬，不遑啟處。
en: My four steeds advanced without stopping; They panted and snorted, the white steeds black-maned. Did I not have the wish to return? But the king's business was not to be slackly performed; And I had not leisure to kneel or to sit.

source: 翩翩者鵻，載飛載下，集于苞栩。王事靡盬，不遑將父。
en: The Filial doves keep flying about, Now soaring aloft, and now descending, Collecting on the bushy oaks; But the king's business was not to be slackly performed; And I had not leisure to nourish my father.

source: 翩翩者鵻，載飛載止，集于苞杞。王事靡盬，不遑將母。
en: The Filial doves keep flying about, Now flying, now stopping, Collecting on the bushy medlars; But the king's business was not to be slackly performed; And I had not leisure to nourish my mother.

source: 駕彼四駱，載驟駸駸。豈不懷歸？是用作歌，將母來諗。
en: I yoked my four white steeds, black-maned; They hurried away with speed. But did I not wish to return? Therefore I make this song, Announcing my wish to nourish my mother.
